Repository: Pepega-corp/Un2
Catalog: Unicon2.Localization/Properties/Resources.*.resx
Languages: ru_ru

source: Add
ru_ru: Добавить

source: Add child
ru_ru: Добавить дочерн. элемент

# AddChildGroup
source: Add сhild group
ru_ru: Добавить дочернюю группу

# AddingMode
source: Adding
ru_ru: Добавление

source: Add key-value pair
ru_ru: Добавить пару ключ-значение

# AddRoot
source: Add root element
ru_ru: Добавить корн. элемент

source: Adress
ru_ru: Адрес

source: Address (dec)
ru_ru: Адрес (dec)

source: Address (hex)
ru_ru: Адрес (hex)

source: ASCII string formatter
ru_ru: В ASCII строку

# AsciiStringFormatterDescription
source: Format recieved bytes to ASCII string
ru_ru: Форматирует полученные байты из устройства в строку

source: Base adress (Dec)
ru_ru: Базовый адрес (Dec)

source: Base adress (Hex)
ru_ru: Базовый адрес (Hex)

source: Base Color
ru_ru: Основной цвет

source: Base Theme
ru_ru: Основная тема

source: Baud Rate
ru_ru: Скорость передачи

# BitGroupFormatterDescription
source: Recieved from device value divides into groups of bits. Every group has its own formatting.
ru_ru: Полученное значение из устройства разделяется на группы битов. Каждая группа битов имеет свое форматирование.

# BitGroupsFormatter
source: Fofmatting by grouping bits
ru_ru: Форматирование по группам битов

# BitwiseIndicatorFormatter
source: Bitwise indicator
ru_ru: Побитовый индикатор

# BitwiseIndicatorFormatterDescription
source: Formatting by detection bits in recieved from device value, and matching index number of bit and string.
ru_ru: Форматирование путем выделения битов из полученного слова и сопоставления порядкового номера бита строковому значению

source: Browse
ru_ru: Просмотр

source: Buffer
ru_ru: Буффер

# BufferEmpty
source: Buffer is empty
ru_ru: Буффер пуст

# BufferInvalidType
source: Buffer contains object of invalid type.
ru_ru: Буффер содержит объект неверного типа

source: Cancel
ru_ru: Отмена

source: Check
ru_ru: Проверить

source: Clean
ru_ru: Очистить

source: ComPort Configuration
ru_ru: Конфигурация COM-порта

source: Configuration
ru_ru: Конфигурация

source: Create
ru_ru: Создать

# CreateAndAddInProject
source: Create & Add in project
ru_ru: Создать и добавить в проект

source: Current formatting
ru_ru: Текущее форматирование

source: Data Bits
ru_ru: Длина

source: Delete
ru_ru: Удалить

source: Delete group
ru_ru: Удалить группу

source: Delete key-value pair
ru_ru: Удалить пару

# DeleteSelectedItemQuestion
source: Do you really want to delete selected item?
ru_ru: Вы действительно хотите удалить выбранный элемент?

source: Deleting
ru_ru: Удаление

source: Device
ru_ru: Устройство

source: Device Editor
ru_ru: Редактор устройств

source: Device File
ru_ru: Файл устройства

source: Devices
ru_ru: Устройства

source: Dictionary matching formatter
ru_ru: По соответствию словаря

# DictionaryMatchingFormatterDescription
source: Recieved value from device is key. Formatter get string by its key from dictionary.
ru_ru: Полученное значение из устройства является ключом. По этому ключу в словаре находится соответствующая строка, которая отображается в поле значения.

# DirectFormatterDescription
source: Value from the device is not formatted
ru_ru: Выводится число, полученное напрямую из устройства, форматирование не применяется.

# DirectUshortFormatter
source: Direct value from device
ru_ru: Вывод значения без обработки

# DublicateValuesMessage
source: Collection has repeatable values
ru_ru: Имеются повторения в коллекции

source: Edit
ru_ru: Редактировать

# EditingMode
source: Editing
ru_ru: Редактирование

source: Error
ru_ru: Ошибка

source: Errors
ru_ru: Ошибки

source: Exit
ru_ru: Выход

# ExitQuestion
source: Do you really want to exit?
ru_ru: Вы действительно хотите выйти?

source: Failed queries
ru_ru: Ошиб. обмены

source: File
ru_ru: Файл

source: Format error
ru_ru: Ошибка формата

# FormatterParameters
source: Formatting parameters
ru_ru: Параметры форматирования

source: Formatting
ru_ru: Форматирование

source: Formula
ru_ru: Формула

source: Formula formatter
ru_ru: Форматирование формулой

# FormulaFormatterDescription
source: Formatter gets X from device as argument for written formula above.
ru_ru: Из устройства берется Х в качестве аргумента в формуле ниже. Формула фолжна быть вида (x*400+256)/65535

source: Fotmatting
ru_ru: Форматирование

source: Get from buffer
ru_ru: Вставить из буффера

# Info
source: Info Messages
ru_ru: Информация

source: Information
ru_ru: Информация

# IsAllLoggingLoggingEnabled
source: Logging all
ru_ru: Логгирование всего

# IsErrorLoggingEnabled
source: Logging errors
ru_ru: Логгирование ошибок

# IsLoggingDisabled
source: Logging disabled
ru_ru: Логгирование отключено

# IsLoggingInFileEnabled
source: Logging in file
ru_ru: Логгирование в файл

source: Is read only
ru_ru: Режим чтения

source: Key
ru_ru: Ключ

source: Language
ru_ru: Язык

source: Last Opened
ru_ru: Последние открытые

source: Load
ru_ru: Загрузить

source: Load Existing
ru_ru: Загрузить существующее

source: Logging
ru_ru: Логгирование

source: Main
ru_ru: Главная

# ModbusMemory
source: Memory view
ru_ru: Просмотр памяти

source: Name
ru_ru: Название

source: NewDevice
ru_ru: НовоеУстройство

source: New Project
ru_ru: Новый проект

source: Not set
ru_ru: Не установлено

# NullOrEmptyMesasage
source: Item must have a value
ru_ru: Элемент должен иметь значение

source: Number
ru_ru: Номер

source: Number of bits
ru_ru: Количество бит

source: Number of points
ru_ru: Количество слов

source: Off Transmission
ru_ru: Выкл. передачи

source: Ok
ru_ru: Ок

source: On Transmission
ru_ru: Вкл. передачи

source: Open Device Editor
ru_ru: Открыть редактор устройств

source: Open log file
ru_ru: Открыть лог-файл

source: Parameters
ru_ru: Параметры

source: Parity
ru_ru: Четность

# Parity_Even
source: Even
ru_ru: Чет

# Parity_Mark
source: Mark
ru_ru: Маркер

# Parity_None
source: None
ru_ru: Нет

# Parity_Odd
source: Odd
ru_ru: Нечет

# Parity_Space
source: Space
ru_ru: Пробел

source: Port
ru_ru: Порт

source: Project
ru_ru: Проект

source: Queries
ru_ru: Обмены

source: Read
ru_ru: Прочитать

# ReallyWantToDeleteWithChildRequest
source: Do you really want to delete element with all his childlen?
ru_ru: Вы действительно хотите удалить этот элемент со всеми его дочерними элементами?

source: Save
ru_ru: Сохранить

source: Save As
ru_ru: Сохранить как

source: Save in file
ru_ru: Сохранить в файл

# SelectedConnectionNullMessage
source: Connection is not selected
ru_ru: Подключение не выбрано

# SelectedDeviceNullMessage
source: Device is not selected
ru_ru: Устройство не выбрано

source: Set in buffer
ru_ru: Копировать в буффер

source: Set log file
ru_ru: Создать лог-файл

source: Slave ID
ru_ru: Номер устройства

source: Stop Bits
ru_ru: Стоп-биты

# StopBits_None
source: None
ru_ru: Нет

source: Successful queries
ru_ru: Успешные обмены

source: Test result
ru_ru: Результат теста

source: Test value of X
ru_ru: Тестовое значение Х

source: Type
ru_ru: Тип

source: Update
ru_ru: Обновить

source: Value
ru_ru: Значение

source: Visual Settings
ru_ru: Настройки отображения

source: Wait Answer
ru_ru: Ожидание ответа

source: Wait Byte
ru_ru: Ожидание байта

source: Write
ru_ru: Записать

source: Device settings
ru_ru: Настройки устройства

source: Apply
ru_ru: Применить

source: Converted value
ru_ru: Приведенное значение

source: Limit of value
ru_ru: Предел значения

source: Scale limit
ru_ru: Предел шкалы

source: Empty device
ru_ru: Пустое устройство

source: Add block
ru_ru: Добавить блок

source: Configuration editor
ru_ru: Редактор конфигурации

source: Device signature
ru_ru: Подпись устройства

# OpeningPortErrorMessage
source: Port opening error
ru_ru: Ошибка открытия порта

# PortErrorMessage
source: Port error
ru_ru: Ошибка порта

source: Connection settings
ru_ru: Настройки подключения

source: Delete device
ru_ru: Удалить устройство

source: Device Data
ru_ru: Данные из устройства

source: Local Data
ru_ru: Данные на компьютере

source: Range
ru_ru: Диапазон

source: Measure unit
ru_ru: Единица измерения

# AddChildElement
source: Add сhild element
ru_ru: Добавить дочернее свойство

# AddElementRoot
source: Add root element
ru_ru: Добавить корневое свойство

source: Add group element
ru_ru: Добавить группу свойств

# AddGroupElementRoot
source: Add root group element
ru_ru: Добавить корневую группу свойств

source: Notifications
ru_ru: Уведомления

source: Signature
ru_ru: Подпись

source: Date/Time
ru_ru: Дата/Время

source: Description
ru_ru: Описание

source: Source
ru_ru: Источник

source: Recent notifications:
ru_ru: Новые уведомления:

source: Logging to file enabled
ru_ru: Логгирование в файл

source: All
ru_ru: Все

source: Windows
ru_ru: Окна

source: Execute query
ru_ru: Выполнить обмен

# Acknowlege
source: The server (or slave) has accepted the request and is processing it, but a long duration of time will be required to do so.This response is returned to prevent a timeout error from occurring in the client(or master)
ru_ru: Сервер (или подчиненный) принял запрос и обрабатывает его. Этот ответ пришел для исключения истечения таймаута.

# EmptyEndPoint
source: Argument endPoint cannot be empty
ru_ru: Конечная точка аргумента не должна быть пустой.

# GatewayPathUnavailable
source: Specialized use in conjunction with gateways, indicates that the gateway was unable to allocate an internal communication path from the input port to the output port for processing the request.Usually means that the gateway is misconfigured or overloaded.
ru_ru: Путь шлюза недоступен.

# GatewayTargetDeviceFailedToRespond
source: Specialized use in conjunction with gateways, indicates that no response was obtained from the target device.Usually means that the device is not present on the network.
ru_ru: Ошибка связанная с работой со шлюзом. Нет ответа от устройства. Обычно означает, что устройства нет в сети.

# HexCharacterCountNotEven
source: Hex string must have even number of characters.
ru_ru: Строка hex должна иметь четное количество символов.

# IllegalDataAddress
source: The data address received in the query is not an allowable address for the server (or slave). More specifically, the combination of reference number and transfer length is invalid.For a controller with 100 registers, the PDU addresses the first register as 0, and the last one as 99. If a request is submitted with a starting register address of 96 and a quantity of registers of 4, then this request will successfully operate(address-wise at least) on registers 96, 97, 98, 99. If a request is submitted with a starting register address of 96 and a quantity of registers of 5, then this request will fail with Exception Code 0x02 “Illegal Data Address” since it attempts to operate on registers 96, 97, 98, 99 and 100, and there is no register with address 100.
ru_ru: Недопустимый адресс данных.

source: Illegal data value.
ru_ru: Недопустимое значение данных.

source: Illegal function.
ru_ru: Недопустимая функция.

source: Memory parity error.
ru_ru: Ошибка четности памяти.

# ModbusMemoryQuery
source: Modbus memory reading query.
ru_ru: Modbus запрос на чтение памяти.

# ModbusSingleMemoryQuery
source: Modbus memory reading query (single)
ru_ru: Modbus запрос на чтение памяти (единичный).

# NetworkBytesNotEven
source: Array networkBytes must contain an even number of bytes.
ru_ru: Массив байт должен быть четным.

source: Slave device busy.
ru_ru: Устройство занято.

source: Slave device failure.
ru_ru: Ошибка устройства.

# TimeoutNotSupported
source: The compact framework UDP client does not support timeouts.
ru_ru: Таймаут не поддерживается.

source: Unknown
ru_ru: Неизвестно.

# WaitRetryGreaterThanZero
source: WaitToRetryMilliseconds must be greater than 0.
ru_ru: Время ожидания и повторения больше нуля.

source: Address
ru_ru: Адрес

source: Value out of range
ru_ru: Значение за пределами допустимого диапазона.

# OneWordEditing
source: Editing word in memory
ru_ru: Редактирование слова в памяти

# WriteModbusMemoryQuery
source: Modbus memory writing query
ru_ru: Modbus запрос на запись в память

# TransferFromDeviceToLocal
source: Transfer data from device to local
ru_ru: Перенести значения из устройства на комп.

source: Value changed
ru_ru: Значение изменено

source: Write local values to device
ru_ru: Записать локальные значения в устройство

source: Edit local configuration values
ru_ru: Редактировать локальные значения

# WriteConfigurationQuery
source: Write configuration.
ru_ru: Запись конфигурации.

# SaveConfiguration
source: Save сonfiguration
ru_ru: Сохранить конфигурацию

source: Load from file
ru_ru: Загрузить из файла

source: Current Item
ru_ru: Текущий элемент

source: General
ru_ru: Общие

# InvalidRangeError
source: Invalid range
ru_ru: Недопустимый диапазон

source: Add group
ru_ru: Добавить группу

source: Reading property query
ru_ru: Запрос на чтение свойства

source: Activation
ru_ru: Активация

source: Settings
ru_ru: Настройки

# ModbusMemoryDescription
source: This block add function of reading and writing device memory.
ru_ru: Этот блок добавляет функцию чтения и записи памяти.

source: Bool formatter
ru_ru: Форматирование правда/ложь

# CollapseLevel
source: Collapse one level
ru_ru: Свернуть один уровень

# ExpandLevel
source: Expand one level
ru_ru: Развернуть один уровень

source: Tree
ru_ru: Дерево

source: Shared resources
ru_ru: Разделяемые ресурсы

source: Added
ru_ru: Добавлено

source: Adding
ru_ru: Добавление

source: Open
ru_ru: Открыть

source: Resource Key
ru_ru: Ключ ресурса

source: Add as resource
ru_ru: Добавить как ресурс

source: Select from resources
ru_ru: Выбрать из ресурсов

source: Close
ru_ru: Закрыть

source: Current resource
ru_ru: Текущий ресурс

source: Reset
ru_ru: Сбросить

source: Select
ru_ru: Выбрать

source: Copy
ru_ru: Копировать

source: Paste
ru_ru: Вставить

source: Paste as child
ru_ru: Вставить как доч. элемент

source: Rename
ru_ru: Переименовать

source: Add Dependent Property
ru_ru: Добавить зависимое свойство

source: DependentProperty
ru_ru: Зависимое свойство

source: Reference
ru_ru: Ссылка

source: Default Formatter
ru_ru: Форматирование по умолчанию

source: Add Condition
ru_ru: Добавить условие

source: Delete Condition
ru_ru: Удалить условие

source: Referenced Property
ru_ru: Ссылаемое свойство

source: Applying Formatter
ru_ru: Применение форматирования

source: Condition
ru_ru: Условие

# ConditionFormatter
source: Formatter applying on condition
ru_ru: Форматирование при выполнении условия

source: Condition Result
ru_ru: Результат проверки

source: Disable Interaction
ru_ru: Запрет взаимодействия

source: Equal
ru_ru: Равно

source: Have False Bit At
ru_ru: Имеет бит "нет" по номеру

source: Have True Bit At
ru_ru: Имеет бит "да" по номеру

source: Less
ru_ru: Меньше

source: Less Or Equal
ru_ru: Меньше либо равно

source: More
ru_ru: Больше

source: More Or Equal
ru_ru: Больше либо равно

source: Not Equal
ru_ru: Не равно

source: Edit Description
ru_ru: Редактировать описание

source: Add range
ru_ru: Добавить диапазон

source: Address ranges
ru_ru: Диапазоны адресов

source: Delete range
ru_ru: Удалить диапазон

source: End address
ru_ru: Адрес конца

# QuickAccessMemory
source: Quick memory access
ru_ru: Быстрый доступ к памяти

source: Start address
ru_ru: Адрес начала

source: Save in default directory
ru_ru: Сохранить в папку по умолчанию

# SaveInDefaultDirectoryDescription
source: Save in default directory ("Devices" in application root)
ru_ru: Сохранение в папку "Devices" в корневой каталог программы

source: No
ru_ru: Нет

source: Yes
ru_ru: Да

source: Number of records
ru_ru: Число записей

source: Open project
ru_ru: Открыть проект

source: Add Complex Property
ru_ru: Добавить составное свойство

# AddSubProperty
source: Add Subproprerty
ru_ru: Добавить подсвойство

source: Complex property
ru_ru: Составное свойство

source: Bits
ru_ru: Биты

source: Check Connection
ru_ru: Проверить подключение

source: Add Complex Record Parameter
ru_ru: Добавить составной параметр

source: Add Record Parameter
ru_ru: Добавить параметр

source: Add Subparameter
ru_ru: Добавить подпараметр

source: Journal
ru_ru: Журнал

# RecordsNumberOfPoints
source: Number Of Points in Record
ru_ru: Количество слов на запись

# UniconJournal
source: Journal
ru_ru: Журнал

source: To
ru_ru: По:

source: Word Format From
ru_ru: Формат Word с:

source: Default Time Formatter
ru_ru: Форматирование времени

# DefaultTimeFormatterDescription
source: Values of words format into time and date. You can select count of words to format and what means each of them.
ru_ru: DefaultTimeFormatterDescription

# DayInMonth
source: Day
ru_ru: День

source: Element
ru_ru: Элемент

source: Elements placement
ru_ru: Расположение элементов

source: Hours
ru_ru: Часы

source: Milliseconds
ru_ru: Миллисекунды

source: Milliseconds decimals places
ru_ru: Число знаков после запятой для миллисекунд

source: Minutes
ru_ru: Минуты

source: Month
ru_ru: Месяц

# NumberOfPointsInUse
source: Number of points to use
ru_ru: Число используемых слов

source: Placement
ru_ru: Расположение

source: Seconds
ru_ru: Секунды

source: Word format not for the whole record
ru_ru: Формат Word не для всей записи

source: Year
ru_ru: Год

source: Add Argument
ru_ru: Добавить аргумент

source: Dynamic values checking impossible
ru_ru: Проверка динамических значений невозможна

source: Complex parameter
ru_ru: Составной параметр

# ReplaceExistingItemQuestion
source: Replace existing item?
ru_ru: Заменить существующий файл?

source: Saving
ru_ru: Сохранение

source: Journal record reading query.
ru_ru: Обмен чтения записи журнала

source: Reading configuration query
ru_ru: Запрос на чтение конфигурации

source: Values
ru_ru: Значения

source: Add analog signal
ru_ru: Добавить аналоговый сигнал

source: Add discret signal
ru_ru: Добавить дискретный сигнал

source: Add discret signal group
ru_ru: Добавить группу дискр-х с-в

source: Elements Count
ru_ru: Кол-во элементов

source: Starting bit
ru_ru: Бит

source: Add measuring group
ru_ru: Добавить группу измерений

source: Measuring
ru_ru: Измерения

source: Measuring monitor
ru_ru: Измерения

source: Loading
ru_ru: Загрузка

source: Presentation
ru_ru: Отображение

source: View All
ru_ru: Показать все

# AnalogMeasuringElement
source: Analog Measuring
ru_ru: Аналоговый сигнал

source: Bit Number In Word
ru_ru: Номер бита в слове

# DiscretMeasuringElement
source: Discret Measuring
ru_ru: Дискретный сигнал

# IsReadingEnabled
source: Reading Enabled
ru_ru: Доступ для чтения

# IsWritingEnabled
source: Writing Enabled
ru_ru: Доступ для записи

source: Modbus Function
ru_ru: Функция Modbus

source: Write Single Bit Query
ru_ru: Обмен установки одного бита

source: Add Control Signal
ru_ru: Добавить сигнал управления

source: Control Signal
ru_ru: Сигнал управления

source: Value To Write
ru_ru: Значение для записи

source: Cycle Loading
ru_ru: Циклический опрос

source: Group
ru_ru: Группа

source: Read measuring signals query
ru_ru: Запрос на чтение сигналов измерений

source: Set False Bit
ru_ru: Установить бит в значение "Нет"

source: Set True Bit
ru_ru: Установить бит в значение "Да"

source: Value (Dec)
ru_ru: Значение (Dec)

source: Value (Hex)
ru_ru: Значение (Hex)

source: Loading sequence
ru_ru: Последовательность загрузки

source: Offset loading sequence
ru_ru: Последовательность загрузки по смещению

# IndexLoadingSequence
source: Indexed loading sequence
ru_ru: Последовательность загрузки по счетчику

source: Journal reading error
ru_ru: Ошибка чтения журнала

source: Add dependent parameter
ru_ru: Добавить зависимый параметр

source: Add Parameter-Tag
ru_ru: Добавить параметр-тэг

source: Address of oscillogram
ru_ru: Адрес осциллограммы

source: Add variable
ru_ru: Добавить переменную

# BoolFormatterDescription
source: If word value equals 0, return value will be true, else false.
ru_ru: Если значение слова будет 0, возвращаемое значение будет "правда", иначе "ложь"

source: Counting structure
ru_ru: Структура отсчета

source: Full page loading
ru_ru: Загрузка всей страницы

source: Loading Parameters
ru_ru: Параметры загрузки

source: Number of points in record
ru_ru: Количество слов в записи

source: Oscilloscope
ru_ru: Осциллограф

source: Oscilloscope Journal
ru_ru: Журнал осциллографа

source: Oscilloscope journal loading sequence
ru_ru: Последовательность загрузки журнала осциллографа

source: Source Parameter
ru_ru: Исходный параметр

# UshortToIntegerFormatter
source: 2 Words to Integer Formatter
ru_ru: Форматирование двух слов в тип Integer

# UshortToIntegerFormatterDescription
source: Value of 2 words format into 1 value of integer type.
ru_ru: Форматирование значения двух слов в тип Integer (32 бита)

source: Oscillogram not loaded.
ru_ru: Осциллограмма не загружена.

# MaxSizeOfRewritableOscillogramInMs
source: Max size of re-writeable osc-m (ms)
ru_ru: Макс. размер перезаписываемой осц-мы (мс)

source: Default bit mask formatter
ru_ru: Стандартное форматирование битовой маской

# DefaultBitMaskFormatterDescription
source: All bits in selected words wil be parsed in array if bits with signatures below (can be empty)
ru_ru: Все биты выбранных слов будут по порядку форматированы в массив битов с подписями ниже (подписи могут отсутствовать)

source: Default property
ru_ru: Стандартное свойство

source: Open oscillogram
ru_ru: Открыть осциллограмму

source: Parameter
ru_ru: Параметр

source: Add Signature
ru_ru: Добавить пустую строку

source: Delete signature
ru_ru: Удалить подпись

# Mask
source: Signature
ru_ru: Название

# SignatureNumberOfPoints
source: Count
ru_ru: Кол-во

# IsInversion
source: Inversion
ru_ru: Инверсия

# AddSignatureGroup
source: Add Group
ru_ru: Добавить группу

source: Is loaded
ru_ru: Загружено

source: Load Selected Oscillograms
ru_ru: Загрузить выбранные осциллограммы

source: Show
ru_ru: Показать

source: Stop
ru_ru: Остановить

source: Project Opened
ru_ru: Проект открыт

source: Project Saved
ru_ru: Проект сохранен

# DefaultItemGroup
source: Group of items
ru_ru: Группа элементов

source: SubProperty
ru_ru: Подсвойство

source: Bit Matrix
ru_ru: Битовая матрица

source: Appointable Matrix
ru_ru: Назначаемая матрица

source: Variables
ru_ru: Переменные

source: Bit
ru_ru: Бит

source: Word
ru_ru: Слово

source: Value Signatures
ru_ru: Подписи значений

source: Possible Values
ru_ru: Возможные значения

source: Add Possible Value
ru_ru: Добавить возможное значение

# BoolMatrixTemplate
source: Boolean MatrixTemplate
ru_ru: Шаблон булевой матрицы

source: False
ru_ru: Ложь

source: List Matrix Template
ru_ru: Шаблон матрицы-списков

source: Must Be
ru_ru: Должен быть

source: Number of bits on each variable
ru_ru: Количество бит на переменную

source: True
ru_ru: Правда

# BoolMatrixTemplateDescription
source: Each variable is described by array of boolean values/
ru_ru: Каждая переменная описывается с помощью массива булевых (правда/ложь) значений.

# ListMatrixTemplateDescription
source: Each variable is described by array of values. Each value can be selected from list of possible.
ru_ru: Каждая переменная описывается с помощью массива ячеек. Значение ячейки выбирается из списки возможных значений.

source: Matrix Template
ru_ru: Шаблон матрицы

source: Number of simbols after comma
ru_ru: Количесто знаков после запятой

# IsKeysAreNumbersOfBits
source: Keys are numbers of bits
ru_ru: Ключи это номера бит по порядку.

source: Increase address
ru_ru: Увеличить адрес

source: Add matrix
ru_ru: Добавить матрицу

source: Arrange Bits In Order
ru_ru: Расставить биты по порядку

source: Decrease Address
ru_ru: Уменьшить адрес

source: Address Iterator
ru_ru: Увеличить адрес на

source: String formatter (1251)
ru_ru: Форматирование в строку (1251)
