Repository: Pepega-corp/Un2
Catalog: Unicon2.Localization/Properties/Resources.*.resx
Languages: ru_ru

# StringFormatter1251Description
source: Formatting bytes from device into string (encoding 1251)
ru_ru: Форматирование полученных байт в строку применяя кодировку 1251

source: Transpone
ru_ru: Транспонировать

source: Connection Testing
ru_ru: Тестирование подключения

# ConnectionTestingDescription
source: Select property to test connection. You can set expected value for this property to find out if connected device matches current description file.
ru_ru: Выберите свойство для теста подключения. Вы можете ввести ожидаемое значение, которое позволяет узнать, совпадает ли данный файл описания с подключенным устройством.

source: Expected value
ru_ru: Ожидаемое значение

source: Property for test
ru_ru: Свойство для теста

source: Interrogate
ru_ru: Опросить

source: Interrogation
ru_ru: Опрос

source: Property address
ru_ru: Адрес свойства

source: Speed
ru_ru: Скорость

source: Devices not found
ru_ru: Устройства не найдены

# AnyDecimalDigitCharacterClassDescription
source: \d Matches any decimal digit.
ru_ru: \d Соответствует любой десятичной цифре.

# AnyWhiteSpaceCharacterClassDescription
source: \s Matches any white-space character.
ru_ru: \s Соответствует любому пробельному символу.

# AnyWordCharacterClassDescription
source: \w Matches any word character.
ru_ru: \w Соответствует любому алфавитно-цифровому знаку.

source: Character Class
ru_ru: Класс символа

# ExactlyNTimesQuantifierDescription
source: {n} Matches the previous element exactly n times.
ru_ru: {n} Предыдущий элемент повторяется ровно n раз.

source: Ip Address
ru_ru: IP адрес

# OneOrMoreTimesQuantifierDescription
source: + Matches the previous element one or more times.
ru_ru: + Соответствует предыдущему элементу один или более раз.

source: Quantifier
ru_ru: Квантификатор (количество вхождений)

# ZeroOrMoreTimesQuantifierDescription
source: * Matches the previous element zero or more times.
ru_ru: * Соответствует предыдущему элементу ноль или более раз.

# IsGroupedProperty
source: Grouped Property
ru_ru: Группировать свойство

# FileBrowserDescription
source: Add function of browsing file system of device.
ru_ru: Дает возможность просмотра файловой системы устройства

source: Current Directory
ru_ru: Текущая папка

source: Memory
ru_ru: Память

source: Multiple assignment allowed
ru_ru: Разрешить множественное назначение

source: Reset conditions
ru_ru: Сбросить условия

source: Download
ru_ru: Загрузить

# ProgrammingEditorDescription
source: Programming editor
ru_ru: Редактор программирования

source: Programming
ru_ru: Программирование

# VersionStringExample
source: Example: MR 5 N\d* VERSION 70.\d
ru_ru: Пример: MR 5 N\d* VERSION 70.\d

source: Assign signals automatically
ru_ru: Автоматически назначить сигналы

source: Clear assigned signals
ru_ru: Очистить назначенные сигналы

source: Clear signatures
ru_ru: Очистить подписи

# EnsuringMessage
source: Are you sure?
ru_ru: Вы уверены?

source: Transform
ru_ru: Преобразовать

source: Dependent parameter
ru_ru: Зависимый параметр

source: Device reading error
ru_ru: Ошибка чтения устройства

source: Table
ru_ru: Таблица

# ExportConfiguration
source: Export сonfiguration
ru_ru: Сохранить для печати

source: Select items to print
ru_ru: Выберите объекты для печати

source: File export successful
ru_ru: Сохранение в файл прошло успешено

source: Table view
ru_ru: Табличный вид

source: Group with reiteration
ru_ru: Группа с повторением

source: Step
ru_ru: Шаг

source: Groups
ru_ru: Группы

source: Height
ru_ru: Высота

source: Offset Left
ru_ru: Отступ справа

source: Offset Top
ru_ru: Отступ сверху

source: Paste Size Only
ru_ru: Вставить только размер

source: Presentation Settings
ru_ru: Настройки отображения

source: Selected Element
ru_ru: Выбранный элемент

source: Width
ru_ru: Ширина

source: Move with children
ru_ru: Двигать с подэлементами

source: Zoom In
ru_ru: Увеличить масштаб

source: Zoom Out
ru_ru: Уменьшить масштаб

source: Block
ru_ru: Блок

source: Bool to address Dependency
ru_ru: Зависимость адреса от значения дискрета

source: Address if false
ru_ru: Адрес при значении "нет"

source: Address if true
ru_ru: Адрес при значении "да"

source: Dependencies
ru_ru: Зависимости

source: Add Date-Time
ru_ru: Добавить Дату-Время

source: Date
ru_ru: Дата

source: Date-Time Measuring Element
ru_ru: Элемент Дата-Время

source: Index Writing Address
ru_ru: Адрес записи индекса

source: Set
ru_ru: Установить

source: Set System
ru_ru: Установить системное

source: Time
ru_ru: Время

source: Save For Print
ru_ru: Сохранить для печати

source: Recent
ru_ru: Последние

source: Formatting If False
ru_ru: Форматирование если нет

source: Formatting If True
ru_ru: Форматирование если да

# DateFormat
source: DD,MM,YY
ru_ru: ДД,ММ,ГГ

source: Default message
ru_ru: Сообщение по умолчанию

source: Use default message
ru_ru: Использовать сообщение по умолчанию

source: Write Function
ru_ru: Функция записи

source: Apply Formatter Result
ru_ru: Результат: Применение форматирования

source: Compare Resource Condition
ru_ru: Условие: проверка ресурсов

source: Condition-Result Dependency
ru_ru: Зависимость: Условие-Результат

source: Add Filter
ru_ru: Добавить фильтр

source: Conditions
ru_ru: Условия

source: Filters
ru_ru: Фильтры

source: Must be positive
ru_ru: Должно быть положительным

source: Filtered Data
ru_ru: Фильтрованные данные

source: Cannot connect device
ru_ru: Невозможно подключить устройство, проверьте настройки подключения

# PortNotSelected
source: Port is not selected
ru_ru: Порт не выбран

# ConnectionLostGoOfflineQuestion
source: Connection lost. Go offline?
ru_ru: Похоже, есть проблемы со связью устройства. Перейти в оффлайн режим?

source: Write Index only first time
ru_ru: Записывать индекс только первый раз

# AutoLoadTabs
source: Load tabs automatically
ru_ru: Автозагрузка при открытии вкладок

source: User settings
ru_ru: Пользовательские настройки

# LoadAllDescription
source: Select components to load and folder path, subfolder for device will be created automatically
ru_ru: Выберите компоненты для загрузки из устройства, затем выберите папку для сохранения файлов, подпапка для устройства будет создана автоматически.

source: Saved successfully
ru_ru: Сохранение прошло успешно

source: In Progress
ru_ru: В ходе выполнения

source: Load All
ru_ru: Загрузить всё

source: Save path
ru_ru: Путь для сохранения

source: Saved with issues
ru_ru: Сохранение прошло с ошибками

source: Download all
ru_ru: Скачать всё

# JournalStructureWarningMessage
source: Journal scructure is not similar to the one you trying to upload. It could cause unpredictable behavior. Do you want to continue anyway?
ru_ru: Структура текущего журнала не совпадает с тем, что вы пытаетесь открыть. Это может привести к непредсказуемому поведению. Продолжить всё равно?

source: Journal Opened
ru_ru: Открыт журнал

source: Warning
ru_ru: Предупреждение

source: Export to excel
ru_ru: Экспорт в Excel

source: Import from Excel
ru_ru: Импорт из Excel

# ExcelListSelectWindowDescription
source: There are more than one list in loaded excel file. Please, select list that will be a source for import.
ru_ru: В загружаемом файле больше одного листа. Пожалуйста, выберите лист из списка для импорта.

source: Basic Values
ru_ru: Базовые Уставки

# BaseValuesWindowDescription
source: Base values for configuration. Every item will add new button in configuration tab. You can add base values from saved configuration values.
ru_ru: Базовые уставки для конфигурации. Каждый элемент добавит кнопку во вкладке конфигурации при подключении устройства. Файл базовой уставки можно взять из сохраненной конфигурации (.cnf файл)

source: @Base values filled
ru_ru: Уставки заполнены значениями

source: Values must be filled
ru_ru: Значения должны быть заполнены

source: Are you sure to apply values
ru_ru: Вы уверены что хотите применить значения?

# ImportPropertiesFromExcelTypeADescription
source: Import properties from excel sequentialy. Every row will be a SubProperty for complex property. Complex propery will be created for every 16 sybproperties. Formatting will be of Yes/no type. Addresses will be set sequentially, you can adjust them later
ru_ru: Импорт свойств из Excel. На каждую строку будет создаваться подсвойство. Каждые 16 подствойств будет создаваться составное свойство. Биты подствойств будут выставлены по очереди в порядке как в таблице. Форматирование каждого подсвойства - Правда-ложь. Адреса можно потом подправить вручную.

# ImportPropertiesFromExcelTypeAHeader
source: Import properties from Excel (Type A)
ru_ru: Импорт свойств из Excel (Тип А)

source: Validation errors
ru_ru: Ошибки валидации

source: Formatting Is Empty
ru_ru: Форматирование не установлено.

source: Fix
ru_ru: Исправить

# ValidationErrorsContinueQuestion
source: There are some validation errors. Would you like to continue saving anyway?
ru_ru: Присутствует одна или несколько ошибок валидации устройства. Всё равно желаете продолжить сохранение?

source: Formatting resource not found
ru_ru: Ресурс для форматирования не найден

source: Graphical Menu
ru_ru: Графическое меню

source: Display Height
ru_ru: Высота дисплея

source: Select Bits
ru_ru: Указать биты

source: Resource for dependency not found
ru_ru: Не найден ресурс для одной из зависимостей.

# CodeFormatterViewModel
source: Code Formatter
ru_ru: Форматирование кодом

source: Format back formula
ru_ru: Формула на обратное форматирование

source: Format formula
ru_ru: Формула на форматирование

# AddFunctionDescription
source: Add two values
ru_ru: Сложить два значения. Сигнатура: Add(x1,x2) Где x1, x2 - значения для сложения Возвращаемое значение: результат сложения

# GetDeviceValueFunctionDescription
source: Gets value from device ushorts GetDeviceValue(number) Where "number" is number of ushort from device
ru_ru: Получить значение, которое пришло из устройства. Адрес и количество слов задается в самом свойстве Сигнатура: GetDeviceValue(x1) Где x1 это номер слова из набора слов, который пришел из устройства (начиная с 0). Возвращаемое значение: слово (число типа ushort)

# SetDeviceValueFunctionDescription
source: Sets value to device ushorts
ru_ru: Задать значение в устройстве по номеру. Адрес и количество записываемых слов задается в самом свойстве Сигнатура: SetDeviceValue(x1,x2) Где x1 - новое значение слова, x2 - номер слова (начиная с 0) Возвращаемое значение: x1

# SetResultValueFunctionDescription
source: Sets result value
ru_ru: Задать результирующее значение, которое будет выводиться пользователю Сигнатура: SetResultValue(x1) Где x1 - значение которое нужно сделать результирующим Возвращаемое значение: x1

# GetResultValueFunctionDescription
source: Gets result value
ru_ru: Получить результирующее значение Сигнатура: GetResultValue() Возвращаемое значение: значение которое будет выводиться пользователю

# PowFunctionDescription
source: Power function
ru_ru: Функция возведения в степень Cигнатура: Pow(x1,x2) Где x1 - значение, которое возводится в степень x2 - степень Возвращаемое значение: результат возведения в степень

# MultiplyFunctionDescription
source: Multiplies two values
ru_ru: Перемножает два числа Сигнатура: Multiply(x1,x2) Где x1 и x2 - умножаемые значения Возвращаемое значение: результат умножения

# SubtractFunctionDescription
source: Subtracts one value from another
ru_ru: Вычитание Сигнатура: Subtract(x1,x2) Где x1 - уменьшаемое x2 - вычитаемое Возвращаемое значение: разность

# DivideFunctionDescription
source: Divides one value by another
ru_ru: Деление Сигнатура: Divide(x1,x2) Где x1 - делимое x2 - делитель Возвращаемое значение: частное

# CompareFunctionDescription
source: Compare two values
ru_ru: Сравнить два значение Сигнатура: Compare(x1, x2, x3) Где x1 -левое x2 - правое x3 - оператор сравнения(<,>,<=,>=,=) Возвращаемое значение: булево значение как результат сравнения

# GetBitOfResourceFunctionDescription
source: Gets bit of resource
ru_ru: Получить бит ресурса (значения из устройства, которое привязано к ресурсу) Сигнатура: GetBitOfResource(x1,x2) Где x1 - номер бита x2 - название ресурса Возвращаемое значение: булево значение бита ресурса

# SetBitOfResourceFunctionDescription
source: Sets bit of resource
ru_ru: Задать значение бита ресурса (значение из устройства, которое привязано к ресурсу) Сигнатура: SetBitOfResource(x1,x2,x3) Где x1 - значение бита x2 - номер бита x3 - имя ресурса Возвращаемое значение: булево значение бита ресурса

# SetVariableFunctionDescription
source: Sets value to the variable
ru_ru: Задать значение переменной Сигнатура: SetVariable(x1,x2) Где x1 - значение переменной x2 - название переменной Возвращаемое значение: значение переменной

# GetVariableFunctionDescription
source: Gets value of the variable
ru_ru: Получить значение переменной Сигнатура: GetVariable(x1) Где x1 - название переменной Возвращаемое значение: значение переменной

# SelectFunctionDescription
source: Selects type of result value
ru_ru: Выбрать тип результирующего значения (значения которое будет выводиться пользователю) Сигнатура: Select(x1, x2) Где x1 - Тип результирующего значения (number,bool,string) x2 - количество знаков после запятой (опционально, можно не указывать) Возвращаемое значение: значение приведенное к типу

# GetInputValueFunctionDescription
source: Gets user input value
ru_ru: Получить введенное пользователем значение Сигнатура: GetInputValue() Возвращаемое значение: значение введенное пользоветелем

# IfFunctionDescription
source: Divides code execution into two branches
ru_ru: Функция, которая разделяет выполение кода по условию Сигнатура: If(x1,x2,x3) Где x1 - условие x2 - функция или значение, которое будет возвращено при соблюдении условия x3 - функция или значение, которое будет возвращено при несоблюдении условия Возвращаемое значение: x1 или x2 в зависимости от выполнении условия

# DoFunctionDescription
source: Execute many functions
ru_ru: Выполнить несколько действий Сигнатура: Do(x1,x2,x3,...) Где x1,x2... - функции, выполняемые одна за другой Возвращаемое значение: результат последней выполенной функции

# InvertSignFunctionDescription
source: Inverts sign
ru_ru: Инвертирует знак входящего значения (плюс на минус, минус на плюс) Сигнатура: InvertSign(x1) Где x1 - значение, знак которого надо поменять Возвращаемое значение: Число с измененным знаком

source: This Bit set in
ru_ru: Этот бит установлен в

source: Cut
ru_ru: Вырезать

source: Hidden
ru_ru: Скрытое

source: Add Dependency
ru_ru: Добавить зависимость

source: Hide property result
ru_ru: Результат: скрытие

source: Regex Match Condition
ru_ru: Проверка регулярным выражением

# RegexResourceFormatterIsNotString
source: Regex resource formatter return type is not String
ru_ru: Ресурс для условия проверки на регулярное выражение имеет форматированиес результатом отличным от строки
